# TypeName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAnyHandle..::..TypeName Property
IFCAnyHandle Class See Also
---
The name of the type of the handle.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string TypeName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TypeName As String
	Get
```

Visual C++
---
```text
public:
property String^ TypeName {
	String^ get ();
}
```

# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace